eval_scripts/todo/vm_clone_experiment/write_performance_on_cloned_vm_images/fio_output/fioOut_8GB_seqWrite_coldCache_4096bs_Ext4_1thread_asynchOff_ext4
Disk stats (read/write):
  sda: ios=9075/2107753, merge=6055/27341, ticks=3310/417769, in_queue=18056, util=98.91%
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=1068: Thu May 22 16:43:53 2025
  write: IOPS=5587, BW=21.8MiB/s (22.9MB/s)(8192MiB/375336msec)
    clat (usec): min=157, max=177728, avg=177.51, stdev=537.89
     lat (usec): min=158, max=177729, avg=177.76, stdev=537.90
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  163], 10.00th=[  167], 20.00th=[  169],
     | 30.00th=[  169], 40.00th=[  172], 50.00th=[  172], 60.00th=[  172],
     | 70.00th=[  174], 80.00th=[  174], 90.00th=[  180], 95.00th=[  190],
     | 99.00th=[  215], 99.50th=[  330], 99.90th=[  586], 99.95th=[  848],
     | 99.99th=[ 3064]
   bw (  KiB/s): min= 9632, max=24200, per=99.99%, avg=22346.69, stdev=2050.76, samples=750
   iops        : min= 2408, max= 6050, avg=5586.65, stdev=512.69, samples=750
  lat (usec)   : 250=99.31%, 500=0.52%, 750=0.11%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.94%, sys=68.29%, ctx=2100697, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=21.8MiB/s (22.9MB/s), 21.8MiB/s-21.8MiB/s (22.9MB/s-22.9MB/s), io=8192MiB (8590MB), run=375336-375336msec

Disk stats (read/write):
  sda: ios=8408/2097427, merge=6106/1343, ticks=2260/353727, in_queue=12752, util=100.00%
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=1067: Thu May 22 16:53:29 2025
  write: IOPS=5425, BW=21.2MiB/s (22.2MB/s)(8192MiB/386547msec)
    clat (usec): min=163, max=174258, avg=182.72, stdev=554.17
     lat (usec): min=163, max=174258, avg=182.96, stdev=554.17
    clat percentiles (usec):
     |  1.00th=[  167],  5.00th=[  169], 10.00th=[  172], 20.00th=[  172],
     | 30.00th=[  172], 40.00th=[  174], 50.00th=[  174], 60.00th=[  176],
     | 70.00th=[  178], 80.00th=[  186], 90.00th=[  190], 95.00th=[  196],
     | 99.00th=[  221], 99.50th=[  338], 99.90th=[  603], 99.95th=[  930],
     | 99.99th=[ 3294]
   bw (  KiB/s): min= 9168, max=22960, per=99.99%, avg=21699.64, stdev=1924.85, samples=773
   iops        : min= 2292, max= 5740, avg=5424.89, stdev=481.22, samples=773
  lat (usec)   : 250=99.28%, 500=0.55%, 750=0.11%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.88%, sys=66.75%, ctx=2100523, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=21.2MiB/s (22.2MB/s), 21.2MiB/s-21.2MiB/s (22.2MB/s-22.2MB/s), io=8192MiB (8590MB), run=386547-386547msec

Disk stats (read/write):
  sda: ios=8408/2097694, merge=6106/1342, ticks=2249/363315, in_queue=13356, util=100.00%