eval_scripts/todo/vm_clone_experiment/write_performance_on_cloned_vm_images/fio_output/fioOut_8GB_seqWrite_coldCache_4096bs_Ext4_1thread_asynchOff_xfs
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=1311: Fri May 23 13:58:06 2025
  write: IOPS=5330, BW=20.8MiB/s (21.8MB/s)(8192MiB/393431msec)
    clat (usec): min=158, max=189285, avg=186.11, stdev=618.09
     lat (usec): min=159, max=189285, avg=186.36, stdev=618.09
    clat percentiles (usec):
     |  1.00th=[  165],  5.00th=[  167], 10.00th=[  169], 20.00th=[  172],
     | 30.00th=[  172], 40.00th=[  172], 50.00th=[  174], 60.00th=[  174],
     | 70.00th=[  176], 80.00th=[  178], 90.00th=[  188], 95.00th=[  194],
     | 99.00th=[  277], 99.50th=[  367], 99.90th=[ 3228], 99.95th=[ 3884],
     | 99.99th=[ 5866]
   bw (  KiB/s): min= 9056, max=23976, per=100.00%, avg=21327.72, stdev=3075.49, samples=786
   iops        : min= 2264, max= 5994, avg=5331.90, stdev=768.90, samples=786
  lat (usec)   : 250=98.79%, 500=0.89%, 750=0.09%, 1000=0.02%
  lat (msec)   : 2=0.05%, 4=0.11%, 10=0.04%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.89%, sys=64.99%, ctx=2100341, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=20.8MiB/s (21.8MB/s), 20.8MiB/s-20.8MiB/s (21.8MB/s-21.8MB/s), io=8192MiB (8590MB), run=393431-393431msec

Disk stats (read/write):
  sda: ios=8380/2099186, merge=6055/4553, ticks=2518/361592, in_queue=15072, util=99.73%
seqWrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 1 thread

seqWrite: (groupid=0, jobs=1): err= 0: pid=921: Fri May 23 17:13:42 2025
  write: IOPS=5660, BW=22.1MiB/s (23.2MB/s)(8192MiB/370511msec)
    clat (usec): min=157, max=110804, avg=175.16, stdev=594.02
     lat (usec): min=157, max=110804, avg=175.42, stdev=594.02
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  165], 10.00th=[  167], 20.00th=[  167],
     | 30.00th=[  169], 40.00th=[  169], 50.00th=[  169], 60.00th=[  169],
     | 70.00th=[  172], 80.00th=[  174], 90.00th=[  178], 95.00th=[  188],
     | 99.00th=[  204], 99.50th=[  210], 99.90th=[  269], 99.95th=[  400],
     | 99.99th=[ 1270]
   bw (  KiB/s): min=17410, max=24352, per=100.00%, avg=22658.34, stdev=1493.25, samples=741
   iops        : min= 4352, max= 6088, avg=5664.39, stdev=373.28, samples=741
  lat (usec)   : 250=99.87%, 500=0.10%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=1.88%, sys=69.07%, ctx=2099154, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2097152,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=22.1MiB/s (23.2MB/s), 22.1MiB/s-22.1MiB/s (23.2MB/s-23.2MB/s), io=8192MiB (8590MB), run=370511-370511msec

Disk stats (read/write):
  sda: ios=6/2097717, merge=0/241, ticks=5/352145, in_queue=14332, util=100.00%